<a href="https://colab.research.google.com/github/saiarun7/Ineuron/blob/main/pandas_data_manupulations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd  
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')   
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [ ]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
type(titanic_train)

pandas.core.frame.DataFrame

In [ ]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
type(titanic_train.dtypes)

pandas.core.series.Series

In [ ]:
dy = titanic_train.dtypes

In [ ]:
dy['Pclass']

dtype('int64')

In [ ]:
dy

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
l = [0,1,2,3,4,5,"sudh" , "kumar" ,"iNeuron"]

In [ ]:
l[6]

'sudh'

In [ ]:
dy[0:100:2]

PassengerId     int64
Pclass          int64
Sex            object
SibSp           int64
Ticket         object
Cabin          object
dtype: object

In [ ]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
type(titanic_train['Age'])

pandas.core.series.Series

In [ ]:
titanic_train['Age'][-1]

KeyError: -1

In [ ]:
list(titanic_train['Age'][::2])

[22.0,
 26.0,
 35.0,
 54.0,
 27.0,
 4.0,
 20.0,
 14.0,
 2.0,
 31.0,
 35.0,
 15.0,
 8.0,
 nan,
 nan,
 40.0,
 nan,
 28.0,
 nan,
 18.0,
 40.0,
 nan,
 19.0,
 nan,
 nan,
 7.0,
 49.0,
 65.0,
 21.0,
 5.0,
 22.0,
 45.0,
 nan,
 29.0,
 17.0,
 32.0,
 21.0,
 32.0,
 nan,
 0.83,
 22.0,
 nan,
 17.0,
 16.0,
 23.0,
 29.0,
 46.0,
 59.0,
 71.0,
 34.0,
 28.0,
 21.0,
 37.0,
 21.0,
 38.0,
 47.0,
 22.0,
 17.0,
 70.5,
 24.0,
 21.0,
 32.5,
 54.0,
 nan,
 nan,
 33.0,
 47.0,
 25.0,
 19.0,
 16.0,
 nan,
 24.0,
 18.0,
 27.0,
 36.5,
 51.0,
 55.5,
 nan]

In [ ]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [ ]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
titanic_train_cat = titanic_train[titanic_train.dtypes[titanic_train.dtypes == 'object'].index]

In [ ]:
type(titanic_train.dtypes[titanic_train.dtypes == 'object'])

pandas.core.series.Series

In [ ]:
titanic_train.dtypes[titanic_train.dtypes == 'object']

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [ ]:
titanic_train_cat.describe()

,Name,Sex,Ticket,Cabin,Embarked
count,156,156,156,31,155
unique,156,2,145,28,3
top,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",male,CA 2144,D26,S
freq,1,100,2,2,110

In [ ]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
type(titanic_train[['Name' ,'Fare' ]])

pandas.core.frame.DataFrame

In [ ]:
titanic_train[['Name']]

                                                  Name
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
..                                                 ...
151                  Pears, Mrs. Thomas (Edith Wearne)
152                                   Meo, Mr. Alfonzo
153                    van Billiard, Mr. Austin Blyler
154                              Olsen, Mr. Ole Martin
155                        Williams, Mr. Charles Duane

[156 rows x 1 columns]

In [ ]:
import numpy as np

In [ ]:
titanic_train_age_null = np.where(titanic_train['Age'].isnull() == True)

In [ ]:
titanic_train[titanic_train['Age'].isnull() == True]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,335677,7.7500,NaN,Q
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
42,43,0,3,"Kraeff, Mr. Theodor",male,NaN,0,0,349253,7.8958,NaN,C
45,46,0,3,"Rogers, Mr. William John",male,NaN,0,0,S.C./A.4. 23567,8.0500,NaN,S
46,47,0,3,"Lennon, Mr. Denis",male,NaN,1,0,370371,15.5000,NaN,Q
47,48,1,3,"O'Driscoll, Miss. Bridget",female,NaN,0,0,14311,7.7500,NaN,Q
48,49,0,3,"Samaan, Mr. Youssef",male,NaN,2,0,2662,21.6792,NaN,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
64,65,0,1,"Stewart, Mr. Albert A",male,NaN,0,0,PC 17605,27.7208,NaN,C
65,66,1,3,"Moubarek, Master. Gerios",male,NaN,1,1,2661,15.2458,NaN,C
76,77,0,3,"Staneff, Mr. Ivan",male,NaN,0,0,349208,7.8958,NaN,S
77,78,0,3,"Moutal, Mr. Rahamin Haim",male,NaN,0,0,374746,8.0500,NaN,S
82,83,1,3,"McDermott, Miss. Brigdet Delia",female,NaN,0,0,330932,7.7875,NaN,Q
87,88,0,3,"Slocovski, Mr. Selman Francis",male,NaN,0,0,SOTON/OQ 392086,8.0500,NaN,S
95,96,0,3,"Shorney, Mr. Charles Joseph",male,NaN,0,0,374910,8.0500,NaN,S
101,102,0,3,"Petroff, Mr. Pastcho (""Pentcho"")",male,NaN,0,0,349215,7.8958,NaN,S
107,108,1,3,"Moss, Mr. Albert Johan",male,NaN,0,0,312991,7.7750,NaN,S
109,110,1,3,"Moran, Miss. Bertha",female,NaN,1,0,371110,24.1500,NaN,Q
121,122,0,3,"Moore, Mr. Leonard Charles",male,NaN,0,0,A4. 54510,8.0500,NaN,S
126,127,0,3,"McMahon, Mr. Martin",male,NaN,0,0,370372,7.7500,NaN,Q
128,129,1,3,"Peter, Miss. Anna",female,NaN,1,1,2668,22.3583,F E69,C
140,141,0,3,"Boulos, Mrs. Joseph (Sultana)",female,NaN,0,2,2678,15.2458,NaN,C
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S

In [ ]:
titanic_train_age_null

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154], dtype=int64),)

In [ ]:
titanic_train[['Name' , 'Pclass']]

                                                  Name  Pclass
0                              Braund, Mr. Owen Harris       3
1    Cumings, Mrs. John Bradley (Florence Briggs Th...       1
2                               Heikkinen, Miss. Laina       3
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)       1
4                             Allen, Mr. William Henry       3
..                                                 ...     ...
151                  Pears, Mrs. Thomas (Edith Wearne)       1
152                                   Meo, Mr. Alfonzo       3
153                    van Billiard, Mr. Austin Blyler       3
154                              Olsen, Mr. Ole Martin       3
155                        Williams, Mr. Charles Duane       1

[156 rows x 2 columns]

In [ ]:
titanic_train.iloc[titanic_train_age_null]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,335677,7.7500,NaN,Q
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
42,43,0,3,"Kraeff, Mr. Theodor",male,NaN,0,0,349253,7.8958,NaN,C
45,46,0,3,"Rogers, Mr. William John",male,NaN,0,0,S.C./A.4. 23567,8.0500,NaN,S
46,47,0,3,"Lennon, Mr. Denis",male,NaN,1,0,370371,15.5000,NaN,Q
47,48,1,3,"O'Driscoll, Miss. Bridget",female,NaN,0,0,14311,7.7500,NaN,Q
48,49,0,3,"Samaan, Mr. Youssef",male,NaN,2,0,2662,21.6792,NaN,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
64,65,0,1,"Stewart, Mr. Albert A",male,NaN,0,0,PC 17605,27.7208,NaN,C
65,66,1,3,"Moubarek, Master. Gerios",male,NaN,1,1,2661,15.2458,NaN,C
76,77,0,3,"Staneff, Mr. Ivan",male,NaN,0,0,349208,7.8958,NaN,S
77,78,0,3,"Moutal, Mr. Rahamin Haim",male,NaN,0,0,374746,8.0500,NaN,S
82,83,1,3,"McDermott, Miss. Brigdet Delia",female,NaN,0,0,330932,7.7875,NaN,Q
87,88,0,3,"Slocovski, Mr. Selman Francis",male,NaN,0,0,SOTON/OQ 392086,8.0500,NaN,S
95,96,0,3,"Shorney, Mr. Charles Joseph",male,NaN,0,0,374910,8.0500,NaN,S
101,102,0,3,"Petroff, Mr. Pastcho (""Pentcho"")",male,NaN,0,0,349215,7.8958,NaN,S
107,108,1,3,"Moss, Mr. Albert Johan",male,NaN,0,0,312991,7.7750,NaN,S
109,110,1,3,"Moran, Miss. Bertha",female,NaN,1,0,371110,24.1500,NaN,Q
121,122,0,3,"Moore, Mr. Leonard Charles",male,NaN,0,0,A4. 54510,8.0500,NaN,S
126,127,0,3,"McMahon, Mr. Martin",male,NaN,0,0,370372,7.7500,NaN,Q
128,129,1,3,"Peter, Miss. Anna",female,NaN,1,1,2668,22.3583,F E69,C
140,141,0,3,"Boulos, Mrs. Joseph (Sultana)",female,NaN,0,2,2678,15.2458,NaN,C
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S

In [ ]:
type(titanic_train.iloc[5])

pandas.core.series.Series

In [ ]:
titanic_train.iloc[5]

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                         NaN
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [ ]:
titanic_train.iloc[[1,2,3,6,7]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [ ]:
titanic_train.iloc[np.where(titanic_train['Fare'] == max(titanic_train['Fare']))]['Name']

27    Fortune, Mr. Charles Alexander
88        Fortune, Miss. Mabel Helen
Name: Name, dtype: object

In [ ]:
titanic_train[titanic_train['Fare']==titanic_train['Fare'].max()]['Name']

27    Fortune, Mr. Charles Alexander
88        Fortune, Miss. Mabel Helen
Name: Name, dtype: object

In [ ]:
titanic_train[titanic_train['Age']==24.0]['Name']

89                                Celotti, Mr. Francesco
118                             Baxter, Mr. Quigg Edmond
127                            Madsen, Mr. Fridtjof Arne
139                                   Giglio, Mr. Victor
142    Hakkarainen, Mrs. Pekka Pietari (Elin Matilda ...
Name: Name, dtype: object

In [ ]:
titanic_train[titanic_train['Age'] == titanic_train['Age'].min()]['Name']

78    Caldwell, Master. Alden Gates
Name: Name, dtype: object

In [ ]:
titanic_train['Age'][titanic_train['Cabin'].isnull()]

0      22.0
2      26.0
4      35.0
5       NaN
7       2.0
       ...
150    51.0
152    55.5
153    40.5
154     NaN
155    51.0
Name: Age, Length: 125, dtype: float64

In [ ]:
titanic_train[['Age','Cabin']][titanic_train.Cabin.isnull()==True]

      Age Cabin
0    22.0   NaN
2    26.0   NaN
4    35.0   NaN
5     NaN   NaN
7     2.0   NaN
..    ...   ...
150  51.0   NaN
152  55.5   NaN
153  40.5   NaN
154   NaN   NaN
155  51.0   NaN

[125 rows x 2 columns]

In [ ]:
titanic_train[titanic_train['Cabin']  == 'NaN']

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [ ]:
titanic_train[titanic_train['Cabin'] == 'NaN']['Age']

Series([], Name: Age, dtype: float64)

In [ ]:
titanic_train[titanic_train["Cabin"].isnull()]["Age"]

0      22.0
2      26.0
4      35.0
5       NaN
7       2.0
       ...
150    51.0
152    55.5
153    40.5
154     NaN
155    51.0
Name: Age, Length: 125, dtype: float64

In [ ]:
titanic_train['Cabin'] == 'NaN'

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154    False
155    False
Name: Cabin, Length: 156, dtype: bool

In [ ]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
titanic_train.iloc[np.where(titanic_train['Cabin'].isnull() == True)][['Age','Cabin']]

      Age Cabin
0    22.0   NaN
2    26.0   NaN
4    35.0   NaN
5     NaN   NaN
7     2.0   NaN
..    ...   ...
150  51.0   NaN
152  55.5   NaN
153  40.5   NaN
154   NaN   NaN
155  51.0   NaN

[125 rows x 2 columns]

In [ ]:
titanic_train.head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C

In [ ]:
titanic_train.Name[(titanic_train.Survived == 1) & (titanic_train.Sex == "male")]

17                     Williams, Mr. Charles Eugene
21                            Beesley, Mr. Lawrence
23                     Sloper, Mr. William Thompson
36                                 Mamee, Mr. Hanna
55                                Woolner, Mr. Hugh
65                         Moubarek, Master. Gerios
74                                    Bing, Mr. Lee
78                    Caldwell, Master. Alden Gates
81                      Sheerlinck, Mr. Jan Baptist
97                  Greenfield, Mr. William Bertram
107                          Moss, Mr. Albert Johan
125                    Nicola-Yarred, Master. Elias
127                       Madsen, Mr. Fridtjof Arne
146    Andersson, Mr. August Edvard ("Wennerstrom")
Name: Name, dtype: object

In [ ]:
titanic_train.Name[(titanic_train.Survived == 0) & (titanic_train.Sex == "male")]

0              Braund, Mr. Owen Harris
4             Allen, Mr. William Henry
5                     Moran, Mr. James
6              McCarthy, Mr. Timothy J
7       Palsson, Master. Gosta Leonard
                    ...
150         Bateman, Rev. Robert James
152                   Meo, Mr. Alfonzo
153    van Billiard, Mr. Austin Blyler
154              Olsen, Mr. Ole Martin
155        Williams, Mr. Charles Duane
Name: Name, Length: 86, dtype: object

In [ ]:
titanic_train['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
151                    Pears, Mrs. Thomas (Edith Wearne)
152                                     Meo, Mr. Alfonzo
153                      van Billiard, Mr. Austin Blyler
154                                Olsen, Mr. Ole Martin
155                          Williams, Mr. Charles Duane
Name: Name, Length: 156, dtype: object

In [ ]:
titanic_train.Name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
151                    Pears, Mrs. Thomas (Edith Wearne)
152                                     Meo, Mr. Alfonzo
153                      van Billiard, Mr. Austin Blyler
154                                Olsen, Mr. Ole Martin
155                          Williams, Mr. Charles Duane
Name: Name, Length: 156, dtype: object

In [ ]:
titanic_train[(titanic_train['Sex']== 'male') & (titanic_train['Survived']== 1)]['Name']

17                     Williams, Mr. Charles Eugene
21                            Beesley, Mr. Lawrence
23                     Sloper, Mr. William Thompson
36                                 Mamee, Mr. Hanna
55                                Woolner, Mr. Hugh
65                         Moubarek, Master. Gerios
74                                    Bing, Mr. Lee
78                    Caldwell, Master. Alden Gates
81                      Sheerlinck, Mr. Jan Baptist
97                  Greenfield, Mr. William Bertram
107                          Moss, Mr. Albert Johan
125                    Nicola-Yarred, Master. Elias
127                       Madsen, Mr. Fridtjof Arne
146    Andersson, Mr. August Edvard ("Wennerstrom")
Name: Name, dtype: object

In [ ]:
titanic_train['new_col'] = "sudh"

In [ ]:
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,sudh
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,sudh
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,sudh
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,sudh
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,sudh
...,...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S,sudh
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S,sudh
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S,sudh
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S,sudh
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C,sudh

In [ ]:
l = [1,2,3,4,5]

In [ ]:
pd.Series(l)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
d = {'key' : "sudh" , "title" :"kumar" , "mail_id" : "sudha@gmail.com"}

In [ ]:
pd.DataFrame(d,index=['key' , 'title' , 'mail_id'])

          key  title          mail_id
key      sudh  kumar  sudha@gmail.com
title    sudh  kumar  sudha@gmail.com
mail_id  sudh  kumar  sudha@gmail.com

In [ ]:
pd.Series(d)

key                   sudh
title                kumar
mail_id    sudha@gmail.com
dtype: object

In [ ]:
arr  = np.random.randn(3,4)

In [ ]:
pd.DataFrame(arr)

          0         1         2         3
0  0.249873 -0.894455 -1.157412 -1.166982
1 -0.803732  2.011122 -0.396354 -0.999178
2 -0.763614 -1.364206  0.064865 -0.326826

In [ ]:
pd.Series(arr)

Exception: Data must be 1-dimensional

In [ ]:
ser = pd.Series(np.array([4,5,6,7,8]),index=['a','b','sudh',"kumar",'c'])

In [ ]:
ser

a        4
b        5
sudh     6
kumar    7
c        8
dtype: int32

In [ ]:
ser['sudh']

6

In [ ]:
ser.iloc[0]

4

In [ ]:
ser.loc['sudh']

6

In [ ]:
ser['sudh']

6

In [ ]:
ser1 = pd.Series(np.array([4,5,6,7,8]),index=[45,51,62,"sudh",83])

In [ ]:
ser1

45      4
51      5
62      6
sudh    7
83      8
dtype: int32

In [ ]:
ser1.loc[51]

5

In [ ]:
df = pd.DataFrame(np.random.randint(3,6,(4,5)),index=['a','b','c','d'],columns=['x','y','z','u','v'])

In [ ]:
df

   x  y  z  u  v
a  4  5  5  3  3
b  4  4  3  4  4
c  4  5  5  5  3
d  3  3  4  4  5

In [ ]:
df.loc[['c','d'],['z','u']]

   z  u
c  5  5
d  4  4

In [ ]:
df.iloc[[2,3],[2,3]]

   z  u
c  5  5
d  4  4

In [ ]:
df.iloc[2:,2:4]

   z  u
c  5  5
d  4  4

In [ ]:
df

   x  y  z  u  v
a  4  5  5  3  3
b  4  4  3  4  4
c  4  5  5  5  3
d  3  3  4  4  5

In [ ]:
df['new'] = df['x'] + df.y

In [ ]:
df

   x  y  z  u  v  new
a  4  5  5  3  3    9
b  4  4  3  4  4    8
c  4  5  5  5  3    9
d  3  3  4  4  5    6

In [ ]:
df.drop('x',axis=1,inplace=True)

In [ ]:
df

   y  z  u  v  new
a  5  5  3  3    9
b  4  3  4  4    8
c  5  5  5  3    9
d  3  4  4  5    6

In [ ]:
df = df.drop('a')

In [ ]:
df

   y  z  u  v  new
b  4  3  4  4    8
d  3  4  4  5    6

In [ ]:
np.random.seed(23)
df = pd.DataFrame(np.random.randn(4,5),index=['a','b','c','d'],columns=['x','y','z','u','v'])

In [ ]:
df

          x         y         z         u         v
a  0.666988  0.025813 -0.777619  0.948634  0.701672
b -1.051082 -0.367548 -1.137460 -1.322148  1.772258
c -0.347459  0.670140  0.322272  0.060343 -1.043450
d -1.009942  0.441736  1.128877 -1.838068 -0.938769

In [ ]:
df[df<0]

          x         y         z         u         v
a       NaN       NaN -0.777619       NaN       NaN
b -1.051082 -0.367548 -1.137460 -1.322148       NaN
c -0.347459       NaN       NaN       NaN -1.043450
d -1.009942       NaN       NaN -1.838068 -0.938769

In [ ]:
df.values[df.values<0]

array([-0.77761941, -1.05108156, -0.36754812, -1.13745969, -1.32214752,
       -0.34745899, -1.04345   , -1.00994188, -1.83806777, -0.93876863])

In [ ]:
df.values[df.iloc[0:5]<0]

array([-0.77761941, -1.05108156, -0.36754812, -1.13745969, -1.32214752,
       -0.34745899, -1.04345   , -1.00994188, -1.83806777, -0.93876863])

In [ ]:

c = df.values[df.values<0]
for i in df.columns:
    for j in df.index:
        if df.loc[j,i] in c:
            print(i,j)

x b
x c
x d
y b
z a
z b
u b
u d
v c
v d

In [ ]:
l = df.values[df<0]
for c in df.columns:
    for v in df.index:
        if df[c][v] in l:
            print(c,v,df[c][v])

x b -1.0510815639071178
x c -0.34745899102186334
x d -1.0099418765878465
y b -0.3675481161171661
z a -0.7776194131918178
z b -1.1374596907250272
u b -1.3221475225908594
u d -1.8380677677579502
v c -1.0434500017467254
v d -0.9387686311201282

In [ ]:
for i in df.columns:
    for j in df.index:
        if df.loc[j,i]<0:
            print(i,j,df.loc[j,i])

x b -1.0510815639071178
x c -0.34745899102186334
x d -1.0099418765878465
y b -0.3675481161171661
z a -0.7776194131918178
z b -1.1374596907250272
u b -1.3221475225908594
u d -1.8380677677579502
v c -1.0434500017467254
v d -0.9387686311201282

In [ ]:
for i in df.columns:
    for j in df.index:
        for k in df.values[df.values<0]:
            print(k,"----",(i,j))

-0.7776194131918178 ---- ('x', 'a')
-1.0510815639071178 ---- ('x', 'a')
-0.3675481161171661 ---- ('x', 'a')
-1.1374596907250272 ---- ('x', 'a')
-1.3221475225908594 ---- ('x', 'a')
-0.34745899102186334 ---- ('x', 'a')
-1.0434500017467254 ---- ('x', 'a')
-1.0099418765878465 ---- ('x', 'a')
-1.8380677677579502 ---- ('x', 'a')
-0.9387686311201282 ---- ('x', 'a')
-0.7776194131918178 ---- ('x', 'b')
-1.0510815639071178 ---- ('x', 'b')
-0.3675481161171661 ---- ('x', 'b')
-1.1374596907250272 ---- ('x', 'b')
-1.3221475225908594 ---- ('x', 'b')
-0.34745899102186334 ---- ('x', 'b')
-1.0434500017467254 ---- ('x', 'b')
-1.0099418765878465 ---- ('x', 'b')
-1.8380677677579502 ---- ('x', 'b')
-0.9387686311201282 ---- ('x', 'b')
-0.7776194131918178 ---- ('x', 'c')
-1.0510815639071178 ---- ('x', 'c')
-0.3675481161171661 ---- ('x', 'c')
-1.1374596907250272 ---- ('x', 'c')
-1.3221475225908594 ---- ('x', 'c')
-0.34745899102186334 ---- ('x', 'c')
-1.0434500017467254 ---- ('x', 'c')
-1.0099418765878465 ---- ('x', 'c')
-1.8380677677579502 ---- ('x', 'c')
-0.9387686311201282 ---- ('x', 'c')
-0.7776194131918178 ---- ('x', 'd')
-1.0510815639071178 ---- ('x', 'd')
-0.3675481161171661 ---- ('x', 'd')
-1.1374596907250272 ---- ('x', 'd')
-1.3221475225908594 ---- ('x', 'd')
-0.34745899102186334 ---- ('x', 'd')
-1.0434500017467254 ---- ('x', 'd')
-1.0099418765878465 ---- ('x', 'd')
-1.8380677677579502 ---- ('x', 'd')
-0.9387686311201282 ---- ('x', 'd')
-0.7776194131918178 ---- ('y', 'a')
-1.0510815639071178 ---- ('y', 'a')
-0.3675481161171661 ---- ('y', 'a')
-1.1374596907250272 ---- ('y', 'a')
-1.3221475225908594 ---- ('y', 'a')
-0.34745899102186334 ---- ('y', 'a')
-1.0434500017467254 ---- ('y', 'a')
-1.0099418765878465 ---- ('y', 'a')
-1.8380677677579502 ---- ('y', 'a')
-0.9387686311201282 ---- ('y', 'a')
-0.7776194131918178 ---- ('y', 'b')
-1.0510815639071178 ---- ('y', 'b')
-0.3675481161171661 ---- ('y', 'b')
-1.1374596907250272 ---- ('y', 'b')
-1.3221475225908594 ---- ('y', 'b')
-0.34745899102186334 ---- ('y', 'b')
-1.0434500017467254 ---- ('y', 'b')
-1.0099418765878465 ---- ('y', 'b')
-1.8380677677579502 ---- ('y', 'b')
-0.9387686311201282 ---- ('y', 'b')
-0.7776194131918178 ---- ('y', 'c')
-1.0510815639071178 ---- ('y', 'c')
-0.3675481161171661 ---- ('y', 'c')
-1.1374596907250272 ---- ('y', 'c')
-1.3221475225908594 ---- ('y', 'c')
-0.34745899102186334 ---- ('y', 'c')
-1.0434500017467254 ---- ('y', 'c')
-1.0099418765878465 ---- ('y', 'c')
-1.8380677677579502 ---- ('y', 'c')
-0.9387686311201282 ---- ('y', 'c')
-0.7776194131918178 ---- ('y', 'd')
-1.0510815639071178 ---- ('y', 'd')
-0.3675481161171661 ---- ('y', 'd')
-1.1374596907250272 ---- ('y', 'd')
-1.3221475225908594 ---- ('y', 'd')
-0.34745899102186334 ---- ('y', 'd')
-1.0434500017467254 ---- ('y', 'd')
-1.0099418765878465 ---- ('y', 'd')
-1.8380677677579502 ---- ('y', 'd')
-0.9387686311201282 ---- ('y', 'd')
-0.7776194131918178 ---- ('z', 'a')
-1.0510815639071178 ---- ('z', 'a')
-0.3675481161171661 ---- ('z', 'a')
-1.1374596907250272 ---- ('z', 'a')
-1.3221475225908594 ---- ('z', 'a')
-0.34745899102186334 ---- ('z', 'a')
-1.0434500017467254 ---- ('z', 'a')
-1.0099418765878465 ---- ('z', 'a')
-1.8380677677579502 ---- ('z', 'a')
-0.9387686311201282 ---- ('z', 'a')
-0.7776194131918178 ---- ('z', 'b')
-1.0510815639071178 ---- ('z', 'b')
-0.3675481161171661 ---- ('z', 'b')
-1.1374596907250272 ---- ('z', 'b')
-1.3221475225908594 ---- ('z', 'b')
-0.34745899102186334 ---- ('z', 'b')
-1.0434500017467254 ---- ('z', 'b')
-1.0099418765878465 ---- ('z', 'b')
-1.8380677677579502 ---- ('z', 'b')
-0.9387686311201282 ---- ('z', 'b')
-0.7776194131918178 ---- ('z', 'c')
-1.0510815639071178 ---- ('z', 'c')
-0.3675481161171661 ---- ('z', 'c')
-1.1374596907250272 ---- ('z', 'c')
-1.3221475225908594 ---- ('z', 'c')
-0.34745899102186334 ---- ('z', 'c')
-1.0434500017467254 ---- ('z', 'c')
-1.0099418765878465 ---- ('z', 'c')
-1.8380677677579502 ---- ('z', 'c')
-0.9387686311201282 ---- ('z', 'c')
-0.7776194131918178 ---- ('z', 'd')
-1.0510815639071178 ---- ('z', 'd')
-0.3675481161171661 ---- ('z', 'd')
-1.1374596907250272 ---- ('z', 'd')
-1.3221475225908594 ---- ('z', 'd')
-0.34745899102186334 ---- ('z', 'd')
-1.0434500017467254 ---- ('z', 'd')
-1.0099418765878465 ---- ('z', 'd')
-1.8380677677579502 ---- ('z', 'd')
-0.9387686311201282 ---- ('z', 'd')
-0.7776194131918178 ---- ('u', 'a')
-1.0510815639071178 ---- ('u', 'a')
-0.3675481161171661 ---- ('u', 'a')
-1.1374596907250272 ---- ('u', 'a')
-1.3221475225908594 ---- ('u', 'a')
-0.34745899102186334 ---- ('u', 'a')
-1.0434500017467254 ---- ('u', 'a')
-1.0099418765878465 ---- ('u', 'a')
-1.8380677677579502 ---- ('u', 'a')
-0.9387686311201282 ---- ('u', 'a')
-0.7776194131918178 ---- ('u', 'b')
-1.0510815639071178 ---- ('u', 'b')
-0.3675481161171661 ---- ('u', 'b')
-1.1374596907250272 ---- ('u', 'b')
-1.3221475225908594 ---- ('u', 'b')
-0.34745899102186334 ---- ('u', 'b')
-1.0434500017467254 ---- ('u', 'b')
-1.0099418765878465 ---- ('u', 'b')
-1.8380677677579502 ---- ('u', 'b')
-0.9387686311201282 ---- ('u', 'b')
-0.7776194131918178 ---- ('u', 'c')
-1.0510815639071178 ---- ('u', 'c')
-0.3675481161171661 ---- ('u', 'c')
-1.1374596907250272 ---- ('u', 'c')
-1.3221475225908594 ---- ('u', 'c')
-0.34745899102186334 ---- ('u', 'c')
-1.0434500017467254 ---- ('u', 'c')
-1.0099418765878465 ---- ('u', 'c')
-1.8380677677579502 ---- ('u', 'c')
-0.9387686311201282 ---- ('u', 'c')
-0.7776194131918178 ---- ('u', 'd')
-1.0510815639071178 ---- ('u', 'd')
-0.3675481161171661 ---- ('u', 'd')
-1.1374596907250272 ---- ('u', 'd')
-1.3221475225908594 ---- ('u', 'd')
-0.34745899102186334 ---- ('u', 'd')
-1.0434500017467254 ---- ('u', 'd')
-1.0099418765878465 ---- ('u', 'd')
-1.8380677677579502 ---- ('u', 'd')
-0.9387686311201282 ---- ('u', 'd')
-0.7776194131918178 ---- ('v', 'a')
-1.0510815639071178 ---- ('v', 'a')
-0.3675481161171661 ---- ('v', 'a')
-1.1374596907250272 ---- ('v', 'a')
-1.3221475225908594 ---- ('v', 'a')
-0.34745899102186334 ---- ('v', 'a')
-1.0434500017467254 ---- ('v', 'a')
-1.0099418765878465 ---- ('v', 'a')
-1.8380677677579502 ---- ('v', 'a')
-0.9387686311201282 ---- ('v', 'a')
-0.7776194131918178 ---- ('v', 'b')
-1.0510815639071178 ---- ('v', 'b')
-0.3675481161171661 ---- ('v', 'b')
-1.1374596907250272 ---- ('v', 'b')
-1.3221475225908594 ---- ('v', 'b')
-0.34745899102186334 ---- ('v', 'b')
-1.0434500017467254 ---- ('v', 'b')
-1.0099418765878465 ---- ('v', 'b')
-1.8380677677579502 ---- ('v', 'b')
-0.9387686311201282 ---- ('v', 'b')
-0.7776194131918178 ---- ('v', 'c')
-1.0510815639071178 ---- ('v', 'c')
-0.3675481161171661 ---- ('v', 'c')
-1.1374596907250272 ---- ('v', 'c')
-1.3221475225908594 ---- ('v', 'c')
-0.34745899102186334 ---- ('v', 'c')
-1.0434500017467254 ---- ('v', 'c')
-1.0099418765878465 ---- ('v', 'c')
-1.8380677677579502 ---- ('v', 'c')
-0.9387686311201282 ---- ('v', 'c')
-0.7776194131918178 ---- ('v', 'd')
-1.0510815639071178 ---- ('v', 'd')
-0.3675481161171661 ---- ('v', 'd')
-1.1374596907250272 ---- ('v', 'd')
-1.3221475225908594 ---- ('v', 'd')
-0.34745899102186334 ---- ('v', 'd')
-1.0434500017467254 ---- ('v', 'd')
-1.0099418765878465 ---- ('v', 'd')
-1.8380677677579502 ---- ('v', 'd')
-0.9387686311201282 ---- ('v', 'd')

In [ ]:
k=df<0
for i in k.columns:
    for j in k.index:
        if k[i][j]==True:
            print(i,j)

x b
x c
x d
y b
z a
z b
u b
u d
v c
v d

In [ ]:
d = {'key1':[1,2,3,4,np.nan],"key2":["sudh" ,"kumar" , np.nan,5,6] ,'key3' :[np.nan,np.nan,np.nan,3,8]}
df = pd.DataFrame(d)

In [ ]:
df

   key1   key2  key3
0   1.0   sudh   NaN
1   2.0  kumar   NaN
2   3.0    NaN   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [ ]:
df.dropna()

   key1 key2  key3
3   4.0    5   3.0

In [ ]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [ ]:
df

   key1   key2  key3
0   1.0   sudh   NaN
1   2.0  kumar   NaN
2   3.0    NaN   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [ ]:
df.dropna(thresh=0)

   key1   key2  key3
0   1.0   sudh   NaN
1   2.0  kumar   NaN
2   3.0    NaN   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [ ]:
df.dropna(thresh=1)

   key1   key2  key3
0   1.0   sudh   NaN
1   2.0  kumar   NaN
2   3.0    NaN   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [ ]:
df.dropna(thresh=2)

   key1   key2  key3
0   1.0   sudh   NaN
1   2.0  kumar   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [ ]:
df.dropna(thresh=3)

   key1 key2  key3
3   4.0    5   3.0

In [ ]:
df

   key1   key2  key3
0   1.0   sudh   NaN
1   2.0  kumar   NaN
2   3.0    NaN   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [ ]:
df.dropna(thresh=4)

Empty DataFrame
Columns: [key1, key2, key3]
Index: []

In [ ]:
df.dropna(axis=1 , thresh=3)

   key1   key2
0   1.0   sudh
1   2.0  kumar
2   3.0    NaN
3   4.0      5
4   NaN      6

In [ ]:
df

   key1   key2  key3
0   1.0   sudh   NaN
1   2.0  kumar   NaN
2   3.0    NaN   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [ ]:
df.fillna(567)

    key1   key2   key3
0    1.0   sudh  567.0
1    2.0  kumar  567.0
2    3.0    567  567.0
3    4.0      5    3.0
4  567.0      6    8.0

In [ ]:
df.fillna(value=df['key1'].mean())

   key1   key2  key3
0   1.0   sudh   2.5
1   2.0  kumar   2.5
2   3.0    2.5   2.5
3   4.0      5   3.0
4   2.5      6   8.0

In [ ]:
df

   key1   key2  key3
0   1.0   sudh   NaN
1   2.0  kumar   NaN
2   3.0    NaN   NaN
3   4.0      5   3.0
4   NaN      6   8.0

In [ ]:
d1 = {'name' :['sudh' , 'visal' , 'umang', 'vishal' ,'umang'],"mail_id" :["sudh@gmail.com", "vishal@gmail.com",'umang@gmail.com','vishal@gmail.com','umang@gmail.com'],
     'salary' :[100,200,500,200,500]}

In [ ]:
df = pd.DataFrame(d1)

In [ ]:
df

     name           mail_id  salary
0    sudh    sudh@gmail.com     100
1   visal  vishal@gmail.com     200
2   umang   umang@gmail.com     500
3  vishal  vishal@gmail.com     200
4   umang   umang@gmail.com     500

In [ ]:
df.groupby('mail_id').mean()

                  salary
mail_id
sudh@gmail.com       100
umang@gmail.com      500
vishal@gmail.com     200

In [ ]:
df.groupby('mail_id').sum()

                  salary
mail_id
sudh@gmail.com       100
umang@gmail.com     1000
vishal@gmail.com     400

In [ ]:
type(df.groupby('mail_id').describe())

pandas.core.frame.DataFrame

In [ ]:
df.groupby('mail_id').describe()

                 salary
                  count   mean  std    min    25%    50%    75%    max
mail_id
sudh@gmail.com      1.0  100.0  NaN  100.0  100.0  100.0  100.0  100.0
umang@gmail.com     2.0  500.0  0.0  500.0  500.0  500.0  500.0  500.0
vishal@gmail.com    2.0  200.0  0.0  200.0  200.0  200.0  200.0  200.0

In [ ]:
df.groupby('mail_id').describe().loc['umang@gmail.com']

salary  count      2.0
        mean     500.0
        std        0.0
        min      500.0
        25%      500.0
        50%      500.0
        75%      500.0
        max      500.0
Name: umang@gmail.com, dtype: float64

In [ ]:
df.groupby('mail_id').describe().loc['umang@gmail.com']['salary']['mean']

500.0

In [ ]:
df.groupby('mail_id').describe().T

mail_id       sudh@gmail.com  umang@gmail.com  vishal@gmail.com
salary count             1.0              2.0               2.0
       mean            100.0            500.0             200.0
       std               NaN              0.0               0.0
       min             100.0            500.0             200.0
       25%             100.0            500.0             200.0
       50%             100.0            500.0             200.0
       75%             100.0            500.0             200.0
       max             100.0            500.0             200.0

In [ ]:
df.groupby('mail_id').describe()

                 salary
                  count   mean  std    min    25%    50%    75%    max
mail_id
sudh@gmail.com      1.0  100.0  NaN  100.0  100.0  100.0  100.0  100.0
umang@gmail.com     2.0  500.0  0.0  500.0  500.0  500.0  500.0  500.0
vishal@gmail.com    2.0  200.0  0.0  200.0  200.0  200.0  200.0  200.0

In [ ]:
arr1 = np.random.randn(3,4)

In [ ]:
arr2 = np.random.randn(3,4)

In [ ]:
arr3 = np.random.randn(3,4)

In [ ]:
df1 = pd.DataFrame(arr1,columns=["A","B","C","D"],index = [0,1,2])

In [ ]:
df2 = pd.DataFrame(arr2,columns=["A","B","C","D"],index = [3,4,5])

In [ ]:
df2

          A         B         C         D
0 -0.071324 -0.045438  1.040886 -0.094035
1 -0.420844 -0.551989 -0.121098  0.190141
2  0.512137  0.131538 -0.331617 -1.632386

In [ ]:
df3 = pd.DataFrame(arr3,columns=["A","B","C","D"],index = [6,7,8])

In [ ]:
df1

          A         B         C         D
0  0.728876  1.968435 -0.547788 -0.679418
1 -2.506230  0.146960  0.606195 -0.022539
2  0.013422  0.935945  0.420623  0.411620

In [ ]:
df2

          A         B         C         D
0 -0.071324 -0.045438  1.040886 -0.094035
1 -0.420844 -0.551989 -0.121098  0.190141
2  0.512137  0.131538 -0.331617 -1.632386

In [ ]:
df3

          A         B         C         D
0  0.619114 -0.992574 -0.161346  1.192404
1  0.250737 -0.813616  0.703624 -0.268142
2 -0.482559  1.244610  0.676860  3.187503

In [ ]:
df4 = pd.concat([df1,df2,df3])

In [ ]:
df5 = pd.concat([df1,df2,df3],axis=1)

In [ ]:
df4

          A         B         C         D
0  0.728876  1.968435 -0.547788 -0.679418
1 -2.506230  0.146960  0.606195 -0.022539
2  0.013422  0.935945  0.420623  0.411620
0 -0.071324 -0.045438  1.040886 -0.094035
1 -0.420844 -0.551989 -0.121098  0.190141
2  0.512137  0.131538 -0.331617 -1.632386
0  0.619114 -0.992574 -0.161346  1.192404
1  0.250737 -0.813616  0.703624 -0.268142
2 -0.482559  1.244610  0.676860  3.187503

In [ ]:
df4.iloc[0]

A    0.728876
B    1.968435
C   -0.547788
D   -0.679418
Name: 0, dtype: float64

In [ ]:
df4.loc[0]

          A         B         C         D
0  0.728876  1.968435 -0.547788 -0.679418
0 -0.071324 -0.045438  1.040886 -0.094035
0  0.619114 -0.992574 -0.161346  1.192404

In [ ]:
df5

,A,B,C,D,A,B,C,D,A,B,C,D
0,0.728876,1.968435,-0.547788,-0.679418,-0.071324,-0.045438,1.040886,-0.094035,0.619114,-0.992574,-0.161346,1.192404
1,-2.506230,0.146960,0.606195,-0.022539,-0.420844,-0.551989,-0.121098,0.190141,0.250737,-0.813616,0.703624,-0.268142
2,0.013422,0.935945,0.420623,0.411620,0.512137,0.131538,-0.331617,-1.632386,-0.482559,1.244610,0.676860,3.187503

In [ ]:
df5['A']

          A         A         A
0  0.728876 -0.071324  0.619114
1 -2.506230 -0.420844  0.250737
2  0.013422  0.512137 -0.482559

In [ ]:
df5.iloc[:,4]

0   -0.071324
1   -0.420844
2    0.512137
Name: A, dtype: float64

In [ ]:
pd.concat([df1,df2,df3],axis=1).fillna(0)

,A,B,C,D,A,B,C,D,A,B,C,D
0,0.728876,1.968435,-0.547788,-0.679418,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
1,-2.506230,0.146960,0.606195,-0.022539,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
2,0.013422,0.935945,0.420623,0.411620,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
3,0.000000,0.000000,0.000000,0.000000,-0.071324,-0.045438,1.040886,-0.094035,0.000000,0.000000,0.000000,0.000000
4,0.000000,0.000000,0.000000,0.000000,-0.420844,-0.551989,-0.121098,0.190141,0.000000,0.000000,0.000000,0.000000
5,0.000000,0.000000,0.000000,0.000000,0.512137,0.131538,-0.331617,-1.632386,0.000000,0.000000,0.000000,0.000000
6,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.619114,-0.992574,-0.161346,1.192404
7,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.250737,-0.813616,0.703624,-0.268142
8,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,-0.482559,1.244610,0.676860,3.187503

In [ ]:
df1

          A         B         C         D
0  0.728876  1.968435 -0.547788 -0.679418
1 -2.506230  0.146960  0.606195 -0.022539
2  0.013422  0.935945  0.420623  0.411620

In [ ]:
df2

          A         B         C         D
3 -0.071324 -0.045438  1.040886 -0.094035
4 -0.420844 -0.551989 -0.121098  0.190141
5  0.512137  0.131538 -0.331617 -1.632386

In [ ]:
np.random.seed(23)
arr1 = np.random.randn(3,4)
np.random.seed(23)
arr2 = np.random.randn(3,4)
df11 = pd.DataFrame(arr1,columns=["A","B","C","D"],index = [0,1,2])
df22 = pd.DataFrame(arr2,columns=["A","B","C","D"],index = [3,4,5])

In [ ]:
df11

          A         B         C         D
0  0.666988  0.025813 -0.777619  0.948634
1  0.701672 -1.051082 -0.367548 -1.137460
2 -1.322148  1.772258 -0.347459  0.670140

In [ ]:
df22

          A         B         C         D
3  0.666988  0.025813 -0.777619  0.948634
4  0.701672 -1.051082 -0.367548 -1.137460
5 -1.322148  1.772258 -0.347459  0.670140

In [ ]:
pd.merge(df11,df22,on= "A")

          A       B_x       C_x       D_x       B_y       C_y       D_y
0  0.666988  0.025813 -0.777619  0.948634  0.025813 -0.777619  0.948634
1  0.701672 -1.051082 -0.367548 -1.137460 -1.051082 -0.367548 -1.137460
2 -1.322148  1.772258 -0.347459  0.670140  1.772258 -0.347459  0.670140

In [ ]:
df1 = pd.DataFrame({'key': ['K0', 'K8', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
df2 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
df1

  key   A   B
0  K0  A0  B0
1  K8  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [ ]:
df2

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [ ]:
pd.merge(df1,df2,on= 'key',how = 'outer')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K8   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1

In [ ]:
df1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
df2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
df1

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [ ]:
df2

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [ ]:
pd.merge(df1,df2,on = ['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

df2 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [ ]:
df1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [ ]:
df2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [ ]:
df1.join(df2,how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3